### pandas library can hold only one dimentional data
###

In [21]:
import pandas as pd
import numpy as np
import seaborn as sns

In [28]:
k=[4,6,2,9,87,40,20,35]
k

[4, 6, 2, 9, 87, 40, 20, 35]

In [33]:
a=np.random.randint(20,50,(5,4))
a

array([[33, 45, 41, 29],
       [39, 26, 20, 39],
       [49, 38, 45, 36],
       [29, 32, 26, 28],
       [20, 40, 39, 40]])

In [35]:
pd.DataFrame(a)

    0   1   2   3
0  33  45  41  29
1  39  26  20  39
2  49  38  45  36
3  29  32  26  28
4  20  40  39  40

In [37]:
a.ndim

2

In [41]:
df1=pd.DataFrame(a,columns=['id','age','marks','height'])
df1

   id  age  marks  height
0  33   45     41      29
1  39   26     20      39
2  49   38     45      36
3  29   32     26      28
4  20   40     39      40

In [45]:
df1=pd.DataFrame(a,columns=['id','age','marks','height'],index=["LEELADHAR","DHANUSH","VENKY","MANU","AKHIL"])
df1

           id  age  marks  height
LEELADHAR  33   45     41      29
DHANUSH    39   26     20      39
VENKY      49   38     45      36
MANU       29   32     26      28
AKHIL      20   40     39      40

In [47]:
sns.get_dataset_names() #predefined datasets(dummy)

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [49]:
df=sns.load_dataset("flights")
df

     year month  passengers
0    1949   Jan         112
1    1949   Feb         118
2    1949   Mar         132
3    1949   Apr         129
4    1949   May         121
..    ...   ...         ...
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

[144 rows x 3 columns]

In [51]:
df=sns.load_dataset("penguins")
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

In [53]:
df=sns.load_dataset("taxis")
df

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.60,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan
1,2019-03-04 16:11:55,2019-03-04 16:19:00,1,0.79,5.0,0.00,0.0,9.30,yellow,cash,Upper West Side South,Upper West Side South,Manhattan,Manhattan
2,2019-03-27 17:53:01,2019-03-27 18:00:25,1,1.37,7.5,2.36,0.0,14.16,yellow,credit card,Alphabet City,West Village,Manhattan,Manhattan
3,2019-03-10 01:23:59,2019-03-10 01:49:51,1,7.70,27.0,6.15,0.0,36.95,yellow,credit card,Hudson Sq,Yorkville West,Manhattan,Manhattan
4,2019-03-30 13:27:42,2019-03-30 13:37:14,3,2.16,9.0,1.10,0.0,13.40,yellow,credit card,Midtown East,Yorkville West,Manhattan,Manhattan
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6428,2019-03-31 09:51:53,2019-03-31 09:55:27,1,0.75,4.5,1.06,0.0,6.36,green,credit card,East Harlem North,Central Harlem North,Manhattan,Manhattan
6429,2019-03-31 17:38:00,2019-03-31 18:34:23,1,18.74,58.0,0.00,0.0,58.80,green,credit card,Jamaica,East Concourse/Concourse Village,Queens,Bronx
6430,2019-03-23 22:55:18,2019-03-23 23:14:25,1,4.14,16.0,0.00,0.0,17.30,green,cash,Crown Heights North,Bushwick North,Brooklyn,Brooklyn
6431,2019-03-04 10:09:25,2019-03-04 10:14:29,1,1.12,6.0,0.00,0.0,6.80,green,credit card,East New York,East Flatbush/Remsen Village,Brooklyn,Brooklyn
6432,2019-03-13 19:31:22,2019-03-13 19:48:02,1,3.85,15.0,3.36,0.0,20.16,green,credit card,Boerum Hill,Windsor Terrace,Brooklyn,Brooklyn

In [55]:
df.shape

(6433, 14)

In [57]:
df.shape[0]

6433

In [59]:
df.shape[1]

14

In [61]:
df.columns

Index(['pickup', 'dropoff', 'passengers', 'distance', 'fare', 'tip', 'tolls',
       'total', 'color', 'payment', 'pickup_zone', 'dropoff_zone',
       'pickup_borough', 'dropoff_borough'],
      dtype='object')

In [67]:
df.columns[0:5]

Index(['pickup', 'dropoff', 'passengers', 'distance', 'fare'], dtype='object')

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6433 entries, 0 to 6432
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   pickup           6433 non-null   datetime64[ns]
 1   dropoff          6433 non-null   datetime64[ns]
 2   passengers       6433 non-null   int64
 3   distance         6433 non-null   float64
 4   fare             6433 non-null   float64
 5   tip              6433 non-null   float64
 6   tolls            6433 non-null   float64
 7   total            6433 non-null   float64
 8   color            6433 non-null   object
 9   payment          6389 non-null   object
 10  pickup_zone      6407 non-null   object
 11  dropoff_zone     6388 non-null   object
 12  pickup_borough   6407 non-null   object
 13  dropoff_borough  6388 non-null   object
dtypes: datetime64[ns](2), float64(5), int64(1), object(6)
memory usage: 703.7+ KB

In [71]:
k=[4,6,2,9,87,40,20,35]
k

[4, 6, 2, 9, 87, 40, 20, 35]

In [75]:
pd.Series(k)

0     4
1     6
2     2
3     9
4    87
5    40
6    20
7    35
dtype: int64

In [77]:
df['fare'].mode

<bound method Series.mode of 0        7.0
1        5.0
2        7.5
3       27.0
4        9.0
        ...
6428     4.5
6429    58.0
6430    16.0
6431     6.0
6432    15.0
Name: fare, Length: 6433, dtype: float64>

In [79]:
df['fare'].mean

<bound method Series.mean of 0        7.0
1        5.0
2        7.5
3       27.0
4        9.0
        ...
6428     4.5
6429    58.0
6430    16.0
6431     6.0
6432    15.0
Name: fare, Length: 6433, dtype: float64>

In [81]:
df['fare'].max

<bound method Series.max of 0        7.0
1        5.0
2        7.5
3       27.0
4        9.0
        ...
6428     4.5
6429    58.0
6430    16.0
6431     6.0
6432    15.0
Name: fare, Length: 6433, dtype: float64>

In [83]:
df['fare'].std

<bound method Series.std of 0        7.0
1        5.0
2        7.5
3       27.0
4        9.0
        ...
6428     4.5
6429    58.0
6430    16.0
6431     6.0
6432    15.0
Name: fare, Length: 6433, dtype: float64>

In [85]:
df['fare'].max

<bound method Series.max of 0        7.0
1        5.0
2        7.5
3       27.0
4        9.0
        ...
6428     4.5
6429    58.0
6430    16.0
6431     6.0
6432    15.0
Name: fare, Length: 6433, dtype: float64>